---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.ElementsWillBeDeleted
source: html/57bc3017-33a9-9fda-bcea-b578d617c735.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.ElementsWillBeDeleted Property

Elements in [Design Option] will be deleted

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementsWillBeDeleted { get; }
```